code/Documents/Договор.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Document>
		<Properties>
			<Name>Договор</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиПутевки</xr:Item>
				<xr:Item>AccumulationRegister.СуммаДоговоров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудник</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиент</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДоговора</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СодержаниеДоговора</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Путевка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Путевка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФИО_туриста</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаПутевки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

code/AccumulationRegisters/ОстаткиПутевки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиПутевки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Путевка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Путевка</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

code/Documents/Договор/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура СодержаниеДоговораПутевкаПриИзменении(Элемент)  
	СтрокаТЧ = Элементы.СодержаниеДоговора.ТекущиеДанные;
	ДатаОтправления = ПолучитьДату(СтрокаТЧ.Путевка); 
	СтрокаТЧ.ЦенаПутевки = ПолучитьСтоимость(СтрокаТЧ.Путевка);
	Если Месяц(ДатаОтправления) = 6 или Месяц(ДатаОтправления) = 8 Или Месяц(ДатаОтправления) = 7 тогда
        СтрокаТЧ.ЦенаПутевки = СтрокаТЧ.ЦенаПутевки * 1.2;   
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьДату (дата)
	ДатаОтправления = дата.ДатаОтправления;
	Возврат ДатаОтправления;
КонецФункции    

&НаСервере
Функция ПолучитьСтоимость (цена)
	СтоимостьТура = цена.Тур.Стоимость;
	Возврат СтоимостьТура;
КонецФункции

&НаКлиенте
Процедура СодержаниеДоговораПриИзменении(Элемент) 
	СтрокаТЧ = Элементы.СодержаниеДоговора.ТекущиеДанные;
	Объект.СуммаДоговора = 0;
	для каждого СтрокаТЧ из Объект.СодержаниеДоговора Цикл
		Объект.СуммаДоговора = Объект.СуммаДоговора + СтрокаТЧ.ЦенаПутевки;
	КонецЦикла; 
КонецПроцедуры   

&НаСервере
Функция СодержаниеДоговораПутевка(Путевка)
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиПутевкиОстатки.Путевка КАК Путевка,
		|	ОстаткиПутевкиОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиПутевки.Остатки КАК ОстаткиПутевкиОстатки
		|ГДЕ
		|	ОстаткиПутевкиОстатки.КоличествоОстаток < &КоличествоОстаток";
	
	Запрос.УстановитьПараметр("КоличествоОстаток", 0);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи 
		Сообщить ("")
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА


КонецФункции
